{
  "architectures": [
    "Sam3LiteTextModel"
  ],
  "detr_decoder_config": {
    "dropout": 0.1,
    "dtype": "float32",
    "hidden_act": "relu",
    "hidden_dropout": 0.0,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_lite_text_detr_decoder",
    "num_attention_heads": 8,
    "num_layers": 6,
    "num_queries": 200
  },
  "detr_encoder_config": {
    "dropout": 0.1,
    "dtype": "float32",
    "hidden_act": "relu",
    "hidden_dropout": 0.0,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_lite_text_detr_encoder",
    "num_attention_heads": 8,
    "num_layers": 6
  },
  "dtype": "float32",
  "geometry_encoder_config": {
    "dropout": 0.1,
    "dtype": "float32",
    "hidden_act": "relu",
    "hidden_dropout": 0.0,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_lite_text_geometry_encoder",
    "num_attention_heads": 8,
    "num_layers": 3,
    "roi_size": 7
  },
  "initializer_range": 0.02,
  "mask_decoder_config": {
    "dropout": 0.0,
    "dtype": "float32",
    "hidden_size": 256,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_lite_text_mask_decoder",
    "num_attention_heads": 8,
    "num_upsampling_stages": 3
  },
  "model_type": "sam3_lite_text",
  "text_config": {
    "attention_dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu",
    "hidden_size": 512,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-05,
    "layer_scale_init_value": 1e-05,
    "max_position_embeddings": 77,
    "model_type": "sam3_lite_text_text_model",
    "num_attention_heads": 8,
    "num_hidden_layers": 6,
    "projection_dim": 512,
    "repmixer_kernel_size": 11,
    "use_repmixer_blocks": true,
    "vocab_size": 49408
  },
  "transformers_version": "5.6.0.dev0",
  "vision_config": {
    "backbone_config": {
      "_name_or_path": "",
      "architectures": null,
      "attention_dropout": 0.0,
      "chunk_size_feed_forward": 0,
      "dtype": "float32",
      "global_attn_indexes": [
        7,
        15,
        23,
        31
      ],
      "hidden_act": "gelu",
      "hidden_dropout": 0.0,
      "hidden_size": 1024,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "image_size": 1008,
      "initializer_range": 0.02,
      "intermediate_size": 4736,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "layer_norm_eps": 1e-06,
      "layer_scale_init_value": null,
      "model_type": "sam3_vit_model",
      "num_attention_heads": 16,
      "num_channels": 3,
      "num_hidden_layers": 32,
      "output_attentions": false,
      "output_hidden_states": false,
      "patch_size": 14,
      "pretrain_image_size": 336,
      "problem_type": null,
      "return_dict": true,
      "rope_theta": 10000.0,
      "window_size": 24
    },
    "backbone_feature_sizes": [
      [
        288,
        288
      ],
      [
        144,
        144
      ],
      [
        72,
        72
      ]
    ],
    "dtype": "float32",
    "fpn_hidden_size": 256,
    "hidden_act": "gelu",
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-06,
    "model_type": "sam3_vision_model",
    "scale_factors": [
      4.0,
      2.0,
      1.0,
      0.5
    ]
  }
}
